orchestrations/PictureAlbums/src/PictureAlbums.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="PictureAlbums" targetNamespace="http://modalis.i3s.unice.fr/jSeduite/orchestrations/wsdl/PictureAlbums"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://modalis.i3s.unice.fr/jSeduite/orchestrations/wsdl/PictureAlbums" xmlns:ns="http://modalis.i3s.unice.fr/jSeduite/orchestrations/schema/PictureAlbums" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types>
        <xsd:schema targetNamespace="http://modalis.i3s.unice.fr/jSeduite/orchestrations/wsdl/PictureAlbums">
            <xsd:import namespace="http://modalis.i3s.unice.fr/jSeduite/orchestrations/schema/PictureAlbums" schemaLocation="PictureAlbums.xsd"/>
        </xsd:schema>
    </types>
    <message name="RetrieveValidAlbumsRequest">
        <part name="input" element="ns:RetrieveValidAlbumsRequest"/>
    </message>
    <message name="RetrieveValidAlbumsResponse">
        <part name="output" element="ns:RetrieveValidAlbumsResponse"/>
    </message>
    <portType name="PictureAlbumsPortType">
        <operation name="RetrieveValidAlbums">
            <input name="input1" message="tns:RetrieveValidAlbumsRequest"/>
            <output name="output1" message="tns:RetrieveValidAlbumsResponse"/>
        </operation>
    </portType>
    <binding name="PictureAlbumsBinding" type="tns:PictureAlbumsPortType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="RetrieveValidAlbums">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal"/>
            </input>
            <output name="output1">
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="PictureAlbumsService">
        <port name="PictureAlbumsPort" binding="tns:PictureAlbumsBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/PictureAlbumsService/PictureAlbumsPort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="PictureAlbums">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="PictureAlbumsPortTypeRole" portType="tns:PictureAlbumsPortType"/>
    </plnk:partnerLinkType>
</definitions>
