jSeduiteBpelComponent/test/PictureAlbums-RetrieveValidAlbums/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pic="http://modalis.i3s.unice.fr/jSeduite/orchestrations/schema/PictureAlbums">
  <soapenv:Body>
    <pic:RetrieveValidAlbumsRequest>
      <pic:limit>10</pic:limit>
    </pic:RetrieveValidAlbumsRequest>
  </soapenv:Body>
</soapenv:Envelope>